; domain
(define (domain dragoon-activity)
(:requirements :strips :typing)

(:types
property node schema - object
description type value equation units - property
accumulator function parameter - node
linear exponential epidemic capacity interaction - schema
extended_exponential - exponential
population_interaction - interaction
)

(:predicates
(is_filled ?p - property ?n - node)
(is_complete ?n - node)
(init ?n - node)
(has_property ?p - property ?n - node)
(applied_schema ?s - schema)
(applied_epidemic_schema ?p1 ?p2 - parameter ?f1 ?f2 ?f3 - function ?a1 ?a2 - accumulator)
(applied_exponential_schema ?p - parameter ?f - function ?a - accumulator)
(applied_extended_exponential_schema ?f1 ?f2 - function ?a - accumulator)
(applied_capacity_schema ?p - parameter ?f - function)
(applied_interaction_schema ?p1 ?p2 - parameter ?f1 ?f2 - function ?a1 ?a2 - accumulator)
(applied_linear_schema ?p - parameter ?a - accumulator)
(is_part ?n - node ?s - schema)
)

(:action create_node
    :parameters (?n - node)
    :precondition (and)
    :effect (and (init ?n))
)

(:action fill_description
	:parameters (?p - description ?n - node)
	:precondition (and (has_property ?p ?n) (init ?n))
	:effect (and (is_filled ?p ?n))
)

(:action fill_type
	:parameters (?t - type ?d - description ?n - node)
	:precondition (and (has_property ?t ?n) (is_filled ?d ?n))
	:effect (and (is_filled ?t ?n))
)

(:action fill_value
	:parameters (?v - value ?t - type ?n - node)
	:precondition (and (has_property ?v ?n) (is_filled ?t ?n))
	:effect (and (is_filled ?v ?n))
)

(:action fill_units
	:parameters (?u - units ?t - type ?n - node)
	:precondition (and (has_property ?u ?n) (is_filled ?t ?n))
	:effect (and (is_filled ?u ?n))
)

(:action fill_equation
	:parameters (?e - equation ?t - type ?n - node)
	:precondition (and (has_property ?e ?n) (is_filled ?t ?n))
	:effect (and (is_filled ?e ?n))
)

(:action complete_accumulator
	:parameters (?d - description ?t - type ?v - value ?u - units ?e - equation ?n - accumulator)
	:precondition (and
					(init ?n)
					(is_filled ?d ?n)
					(is_filled ?t ?n)
					(is_filled ?v ?n)
					(is_filled ?u ?n)
					(is_filled ?e ?n)
				)
	:effect (and (is_complete ?n))
)

(:action complete_parameter
	:parameters (?d - description ?t - type ?v - value ?u - units ?n - parameter)
	:precondition (and
					(init ?n)
					(is_filled ?d ?n)
					(is_filled ?t ?n)
					(is_filled ?v ?n)
					(is_filled ?u ?n)
				)
	:effect (and (is_complete ?n))
)

(:action complete_function
	:parameters (?d - description ?t - type ?u - units ?e - equation ?n - function)
	:precondition (and
					(init ?n)
					(is_filled ?d ?n)
					(is_filled ?t ?n)
					(is_filled ?u ?n)
					(is_filled ?e ?n)
				)
	:effect (and (is_complete ?n))
)

(:action complete_linear_schema
	:parameters (?p - parameter ?a - accumulator ?s - linear)
	:precondition (and
					(is_part ?p ?s)
					(is_complete ?p)
					(is_part ?a ?s)
					(is_complete ?a)
				)
	:effect (and (applied_schema ?s) (applied_linear_schema ?p ?a))
)

(:action complete_exponential_schema
	:parameters (?p - parameter ?f - function ?a - accumulator ?s - exponential)
	:precondition (and
					(is_part ?p ?s)
					(is_complete ?p)
					(is_part ?f ?s)
					(is_complete ?f)
					(is_part ?a ?s)
					(is_complete ?a)
				)
	:effect (and (applied_schema ?s) (applied_exponential_schema ?p ?f ?a))
)

(:action complete_extended_exponential_schema
	:parameters (?f1 ?f2 - function ?a - accumulator ?s - extended_exponential)
	:precondition (and
					(is_part ?f1 ?s)
					(is_complete ?f1)
					(is_part ?f2 ?s)
					(is_complete ?f2)
					(is_part ?a ?s)
					(is_complete ?a)
				)
	:effect (and (applied_schema ?s) (applied_extended_exponential_schema ?f1 ?f2 ?a))
)

(:action complete_capacity_schema
	:parameters (?p - parameter ?f - function ?s - capacity)
	:precondition (and
					(is_part ?p ?s)
					(is_complete ?p)
					(is_part ?f ?s)
					(is_complete ?f)
				)
	:effect (and (applied_schema ?s) (applied_capacity_schema ?p ?f))
)

(:action complete_interaction_schema
	:parameters (?p1 ?p2 - parameter ?f1 ?f2 - function ?a1 ?a2 - accumulator ?s - interaction)
	:precondition (and
					(is_part ?p1 ?s)
					(is_part ?p2 ?s)
					(is_complete ?p1)
					(is_complete ?p2)
					(is_part ?f1 ?s)
					(is_part ?f2 ?s)
					(is_complete ?f1)
					(is_complete ?f2)
					(is_part ?a1 ?s)
					(is_part ?a2 ?s)
					(is_complete ?a1)
					(is_complete ?a2)
				)
	:effect (and (applied_schema ?s) (applied_interaction_schema ?p1 ?p2 ?f1 ?f2 ?a1 ?a2))
)

(:action complete_epidemic_schema
	:parameters (?p1 ?p2 - parameter ?f1 ?f2 ?f3 - function ?a1 ?a2 - accumulator ?s - epidemic)
	:precondition (and
					(is_part ?p1 ?s)
					(is_part ?p2 ?s)
					(is_complete ?p1)
					(is_complete ?p2)
					(is_part ?f1 ?s)
					(is_part ?f2 ?s)
					(is_part ?f3 ?s)
					(is_complete ?f1)
					(is_complete ?f2)
					(is_complete ?f3)
					(is_part ?a1 ?s)
					(is_part ?a2 ?s)
					(is_complete ?a1)
					(is_complete ?a2)
				)
	:effect (and (applied_schema ?s) (applied_epidemic_schema ?p1 ?p2 ?f1 ?f2 ?f3 ?a1 ?a2))
)
)

; problem
(define (problem isle2)
(:domain dragoon-activity)

(:objects 
	moose_population - accumulator
	moose_births - function
	moose_birth_probability - parameter
	exponential_growth - exponential
	da df dp - description
	ta tf tp - type
	va vp - value
	ua uf up - units
	ea ef - equation
)

(:init
	(is_part moose_population exponential_growth)
	(is_part moose_births exponential_growth)
	(is_part moose_birth_probability exponential_growth)
	(has_property da moose_population)
	(has_property ta moose_population)
	(has_property va moose_population)
	(has_property ua moose_population)
	(has_property ea moose_population)
	(has_property df moose_births)
	(has_property tf moose_births)
	(has_property uf moose_births)
	(has_property ef moose_births)
	(has_property dp moose_birth_probability)
	(has_property tp moose_birth_probability)
	(has_property vp moose_birth_probability)
	(has_property up moose_birth_probability)
)

(:goal
	(and
	(applied_schema exponential_growth)
	(applied_exponential_schema moose_birth_probability moose_births moose_population)
	)
)
)

; plan
1. (create_node moose_birth_probability)
   added: (init moose_birth_probability)
   goals met: 0 of 2
2. (create_node moose_births)
   added: (init moose_births)
   goals met: 0 of 2
3. (create_node moose_population)
   added: (init moose_population)
   goals met: 0 of 2
4. (fill_description da moose_population)
   added: (is_filled da moose_population)
   goals met: 0 of 2
5. (fill_type ta da moose_population)
   added: (is_filled ta moose_population)
   goals met: 0 of 2
6. (fill_equation ea ta moose_population)
   added: (is_filled ea moose_population)
   goals met: 0 of 2
7. (fill_units ua ta moose_population)
   added: (is_filled ua moose_population)
   goals met: 0 of 2
8. (fill_value va ta moose_population)
   added: (is_filled va moose_population)
   goals met: 0 of 2
9. (complete_accumulator da ta va ua ea moose_population)
   added: (is_complete moose_population)
   goals met: 0 of 2
10. (fill_description df moose_births)
   added: (is_filled df moose_births)
   goals met: 0 of 2
11. (fill_type tf df moose_births)
   added: (is_filled tf moose_births)
   goals met: 0 of 2
12. (fill_equation ef tf moose_births)
   added: (is_filled ef moose_births)
   goals met: 0 of 2
13. (fill_units uf tf moose_births)
   added: (is_filled uf moose_births)
   goals met: 0 of 2
14. (complete_function df tf uf ef moose_births)
   added: (is_complete moose_births)
   goals met: 0 of 2
15. (fill_description dp moose_birth_probability)
   added: (is_filled dp moose_birth_probability)
   goals met: 0 of 2
16. (fill_type tp dp moose_birth_probability)
   added: (is_filled tp moose_birth_probability)
   goals met: 0 of 2
17. (fill_units up tp moose_birth_probability)
   added: (is_filled up moose_birth_probability)
   goals met: 0 of 2
18. (fill_value vp tp moose_birth_probability)
   added: (is_filled vp moose_birth_probability)
   goals met: 0 of 2
19. (complete_parameter dp tp vp up moose_birth_probability)
   added: (is_complete moose_birth_probability)
   goals met: 0 of 2
20. (complete_exponential_schema moose_birth_probability moose_births moose_population exponential_growth)
   added: (applied_schema exponential_growth) (applied_exponential_schema moose_birth_probability moose_births moose_population)
   goals met: 2 of 2
